title: Driver Load - MonProcessEX.sys
id: a77cf51d-a4e3-5fb6-b60b-c0a29c3f6235
status: experimental
description: |
    Detects loading of driver MonProcessEX.sys via hash.
    MonProcessEX.sys is a HONOR MagicAnimation and HONOR PCManager kernel driver that exposes IOCTL 0x22400C to reach ZwTerminateProcess. The device is accessible to LocalSystem and local administrators, and the process-termination path does not verify the caller, allowing an administrator-accessible client to terminate arbitrary user-mode processes except PID 0 and PID 4 from kernel mode.
references:
    - https://www.loldrivers.io/drivers/c3c083d2-e9bd-4891-8582-46086de2b2b4/
    - https://github.com/magicsword-io/LOLDrivers/issues/384
author: Michael Haag
date: 2026/07/08
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=b32a250d1ef99bb62dd66cea60311f43'
            - 'SHA1=e674c507ca0c61854c61e316acdf711c790f5d24'
            - 'SHA256=72d0b5615b996cbb01b1ca139e627079094f734da48a0435ffd8480a25d0a258'
            - 'IMPHASH=e5c2e380d0150ab25a79920138b8cc4b'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
