title: Driver Load - ktapi.sys
id: 295f4bac-8f6e-5b7d-ad9d-fc9a03a72e58
status: experimental
description: |
    Detects loading of driver ktapi.sys via hash.
    ktapi.sys is a legacy cross-signed Kontron Technology Application Programming Interface driver that exposes the \\.\ktapi device to user mode. IOCTL 0x82007000 accepts a caller-controlled interface type, bus address, and size before using HalTranslateBusAddress, ZwOpenSection, and ZwMapViewOfSection to map physical memory into the calling process. Certain interface types cause HalTranslateBusAddress to return the supplied address unchanged, allowing an attacker to map arbitrary system RAM for physical-memory read and write. Expel documented this primitive in an EDR-killer exploit used by The Gentlemen ransomware group to obtain kernel code execution and terminate security processes.
references:
    - https://www.loldrivers.io/drivers/8a6aebaa-34aa-46e8-a864-4189a55fd17b/
    - https://expel.com/blog/not-very-gentlemanly-analyzing-a-zero-day-exploit-used-by-the-gentlemen-ransomware-to-disable-targets-edrs/
    - https://github.com/magicsword-io/LOLDrivers/issues/386
author: Aaron Walton
date: 2026/07/10
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=e3c123a2ee4720001ed35d45fa1e57eb'
            - 'MD5=96a8b9db2dc9cba8cdf90c7c33fe11c4'
            - 'MD5=2c10be1aea72b7bdf07c735a4ad68876'
            - 'SHA1=92f5c4fd5791db408fa801fd3d887870691af1f8'
            - 'SHA1=8b5cf43fba2c2226e6146ee065490dad17acc820'
            - 'SHA1=86c85f4cbc36377d6fdb3f2af7d3049d5174c62c'
            - 'SHA256=7ee17efef04bb7c9de90d5210263ed6993f867e5a11f86e65e3bb1362c7de237'
            - 'SHA256=9ca9432b0d29204cb5420a1a6b01533d4552130c2a8a5ecd7837efadefb4a046'
            - 'SHA256=89ba754861e11d9db4440b2b5db61fd5bee16752e4623c4271b8fdd0a666c677'
            - 'IMPHASH=ec4687bc52f296b7dcdfa7967aecbc0c'
            - 'IMPHASH=70988f60e2fd3f3d7776089a737aece5'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
