title: Driver Load - MonProcessEX.sys
id: 7595d506-f082-532a-a844-2003fb0e0251
status: experimental
description: |
    Detects loading of driver MonProcessEX.sys via name.
    MonProcessEX.sys is a HONOR MagicAnimation and HONOR PCManager kernel driver that exposes IOCTL 0x22400C to reach ZwTerminateProcess. The device is accessible to LocalSystem and local administrators, and the process-termination path does not verify the caller, allowing an administrator-accessible client to terminate arbitrary user-mode processes except PID 0 and PID 4 from kernel mode.
references:
    - https://www.loldrivers.io/drivers/c3c083d2-e9bd-4891-8582-46086de2b2b4/
    - https://github.com/magicsword-io/LOLDrivers/issues/384
author: Michael Haag
date: 2026/07/08
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\monprocessex.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
