title: Driver Load - QIOMem.sys
id: 3fc41971-e589-5425-bb59-446fb5817391
status: experimental
description: |
    Detects loading of driver QIOMem.sys via name.
    QIOMem.sys is the Generic IO & Memory Access driver included with Toshiba and Dynabook password utilities. It binds to ACPI\QCI0701; on systems without that firmware device, the public proof of concept creates a matching software PnP device to trigger loading of an already-installed driver package. Six IOCTLs (0x08012000 through 0x08012014) pass an unvalidated 32-bit physical address to MmMapIoSpace, allowing a low-privileged process to read or write one, two, or four bytes of physical memory below 4 GiB.
references:
    - https://www.loldrivers.io/drivers/6eca187c-8fb2-4eae-9c80-fd9ef9d8c91e/
    - https://github.com/valium007/qiomem
    - https://valium007.github.io/posts/toshiba-vuln/
    - https://jvn.jp/vu/JVNVU91051826/
    - https://www.cve.org/CVERecord?id=CVE-2026-56129
    - https://dynabook.com/assistpc/info/2026/20260619_security.htm
author: valium
date: 2026/07/10
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\qiomem.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
