title: Driver Load - AccelLid.sys
id: fba4e19d-2edd-5160-a933-cb82a0347c99
status: experimental
description: |
    Detects loading of driver AccelLid.sys via name.
    AccelLid.sys is an Elitegroup Computer Systems lid accelerometer kernel driver. Northwave Cyber Security reported a local denial-of-service vulnerability with a CVSSv3 score of 5.5. The driver exposes IOCTL paths for accelerometer commands, keyboard control, event registration, and ACPI method execution. Microsoft's vulnerable driver blocklist denies AccelLid.sys across all file versions for matching Elitegroup publisher and signing roots.
references:
    - https://www.loldrivers.io/drivers/d9e9fab2-6b64-4c14-b1ec-7af1923c0773/
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/design/microsoft-recommended-driver-block-rules
    - https://github.com/magicsword-io/LOLDrivers/issues/355
author: Northwave Cyber Security
date: 2024/09/11
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_name:
        ImageLoaded|endswith:
            - '\accellid.sys'
    condition: selection_name
falsepositives:
    - Unknown
level: low
