title: Driver Load - AccelLid.sys
id: a4d7490c-2202-5519-9f36-9681f7325012
status: experimental
description: |
    Detects loading of driver AccelLid.sys via hash.
    AccelLid.sys is an Elitegroup Computer Systems lid accelerometer kernel driver. Northwave Cyber Security reported a local denial-of-service vulnerability with a CVSSv3 score of 5.5. The driver exposes IOCTL paths for accelerometer commands, keyboard control, event registration, and ACPI method execution. Microsoft's vulnerable driver blocklist denies AccelLid.sys across all file versions for matching Elitegroup publisher and signing roots.
references:
    - https://www.loldrivers.io/drivers/d9e9fab2-6b64-4c14-b1ec-7af1923c0773/
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/app-control-for-business/design/microsoft-recommended-driver-block-rules
    - https://github.com/magicsword-io/LOLDrivers/issues/355
author: Northwave Cyber Security
date: 2024/09/11
modified: 2026/07/10
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
    - loldrivers.vulnerable
logsource:
    product: windows
    category: driver_load
detection:
    selection_hashes:
        Hashes|contains:
            - 'MD5=887e6502a420acb183342c60c396b0e3'
            - 'MD5=833becd0e4abc9cfff8c835694694f80'
            - 'SHA1=19871a15d483b9be1aa868a31a3384513b05e8ba'
            - 'SHA256=08675796b8712e0e4ccbdf7831450b907bb94c2e3e85560d9aba1b24931f0d55'
            - 'IMPHASH=082b83ad4226208cdab708a369872223'
    condition: selection_hashes
falsepositives:
    - Unknown
level: high
